system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


//internalField uniform $xMin;
//
//vertices
//(
//    ($!backgroundMesh/xMin $!backgroundMesh/yMin $!backgroundMesh/zMin)
//    ($!backgroundMesh/xMax $!backgroundMesh/yMin $!backgroundMesh/zMin)
//    ($!backgroundMesh/xMax $!backgroundMesh/yMax $!backgroundMesh/zMin)
//    ($!backgroundMesh/xMin $!backgroundMesh/yMax $!backgroundMesh/zMin)
//
//    ($!backgroundMesh/xMin $!backgroundMesh/yMin $!backgroundMesh/zMax)
//    ($!backgroundMesh/xMax $!backgroundMesh/yMin $!backgroundMesh/zMax)
//    ($!backgroundMesh/xMax $!backgroundMesh/yMax $!backgroundMesh/zMax)
//    ($!backgroundMesh/xMin $!backgroundMesh/yMax $!backgroundMesh/zMax)
//);

backgroundMesh
{
    xMin   0;
    xMax   200;
    yMin   0;
    yMax   50;
    zMin   0;
    zMax   50;
    xCells  100;
    yCells  25;
    zCells  25;
}

convertToMeters 1;

vertices
(
    ($!backgroundMesh/xMin $!backgroundMesh/yMin $!backgroundMesh/zMin)
    ($!backgroundMesh/xMax $!backgroundMesh/yMin $!backgroundMesh/zMin)
    ($!backgroundMesh/xMax $!backgroundMesh/yMax $!backgroundMesh/zMin)
    ($!backgroundMesh/xMin $!backgroundMesh/yMax $!backgroundMesh/zMin)

    ($!backgroundMesh/xMin $!backgroundMesh/yMin $!backgroundMesh/zMax)
    ($!backgroundMesh/xMax $!backgroundMesh/yMin $!backgroundMesh/zMax)
    ($!backgroundMesh/xMax $!backgroundMesh/yMax $!backgroundMesh/zMax)
    ($!backgroundMesh/xMin $!backgroundMesh/yMax $!backgroundMesh/zMax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (
        $!backgroundMesh/xCells
        $!backgroundMesh/yCells
        $!backgroundMesh/zCells
    )
    simpleGrading (1 1 1)
);

boundary
(
    //inlet
    //{
    //    type patch;
    //    faces
    //    (
    //        (0 3 7 4)
    //    );
    //}

    //outlet
    //{
    //    type patch;
    //    faces
    //    (
    //        (1 5 6 2)
    //    );
    //}

    inout
    {
        type patch;
        faces
        (
            (0 3 7 4)
            (1 5 6 2)
        );
    }

    roof
    {
        type wall;
        faces
        (
            (4 7 6 5)
        );
    }
    floor
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    sides
    {
        type symmetry;
        faces
        (
            (0 4 5 1)
            (3 2 6 7)
        );
    }

);

// ************************************************************************* //
