0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
62500
(
(0.0200001 -1.13212e-11 1.01899e-09)
(0.0200001 -1.51812e-11 1.97221e-09)
(0.0200001 -1.88996e-11 2.38051e-09)
(0.0200001 -2.06261e-11 2.50676e-09)
(0.0200001 -2.13022e-11 2.48202e-09)
(0.0200001 -2.1177e-11 2.37252e-09)
(0.0200001 -2.04062e-11 2.21429e-09)
(0.02 -1.92066e-11 2.02929e-09)
...
)
;

boundaryField
{
    inout
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
1250
(
(0.0200001 0 0)
(0.0200001 0 0)
(0.0200001 0 0)
(0.0200001 0 0)
(0.0200001 0 0)
(0.0200001 0 0)
(0.0200001 0 0)
(0.0200001 0 0)
...
)
;
    }
    roof
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    floor
    {
        type            noSlip;
    }
    sides
    {
        type            symmetry;
    }
}


// ************************************************************************* //
