0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
62500
(
-0.0143712
-0.0385194
-0.0594493
-0.0769811
-0.0914
-0.103052
-0.112279
-0.119411
...
)
;

boundaryField
{
    inout
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           nonuniform List<scalar> 
1250
(
-0.000200002
-0.000200002
-0.000200002
-0.000200002
-0.000200002
-0.000200002
-0.000200002
-0.000200002
...
)
;
    }
    roof
    {
        type            zeroGradient;
    }
    floor
    {
        type            zeroGradient;
    }
    sides
    {
        type            symmetry;
    }
}


// ************************************************************************* //
